"""Task1. 5 points
Написать функцию которая будет принимать 3 аргумента (int) и находить максимум из них """
# create a function that takes three values
def max_argument(a, b, c):
    # the function outputs the maximum argument from the input
    return max(a, b, c)
# output the result of the function execution
print(max_argument(10, 20, 30))
